Terraform Plan:

```
Acquiring state lock. This may take a few moments...
module.data_ingester.random_string.resource_code: Refreshing state... [id=p3sha]
module.data_ingester.data.azurerm_client_config.current: Reading...
module.data_ingester.azurerm_resource_group.tfstate: Refreshing state... [id=/subscriptions/32591f22-8209-4c82-a65c-618b967e7bff/resourceGroups/s194d00-SSPHP-Metrics]
module.data_ingester.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iN2VjMGExZC1hZjAyLTQ2YzUtOTdkMS05MDBkNGUzMmNmOTM7b2JqZWN0SWQ9YjdlY2YxYWUtYzE0Zi00YmU4LWE4ZDEtZGI3YjUxNTdkNWQ5O3N1YnNjcmlwdGlvbklkPTMyNTkxZjIyLTgyMDktNGM4Mi1hNjVjLTYxOGI5NjdlN2JmZjt0ZW5hbnRJZD05YzdkOWRkMy04NDBjLTRiM2YtODE4ZS01NTI4NjUwODJlMTY=]
module.data_ingester.azurerm_service_plan.SSPHP_rust: Refreshing state... [id=/subscriptions/32591f22-8209-4c82-a65c-618b967e7bff/resourceGroups/s194d00-SSPHP-Metrics/providers/Microsoft.Web/serverFarms/SSPHP-Metrics_rust-p3sha]
module.data_ingester.azurerm_storage_account.tfstate: Refreshing state... [id=/subscriptions/32591f22-8209-4c82-a65c-618b967e7bff/resourceGroups/s194d00-SSPHP-Metrics/providers/Microsoft.Storage/storageAccounts/tfstatep3sha]
module.data_ingester.azurerm_storage_container.tfstate: Refreshing state... [id=https://tfstatep3sha.blob.core.windows.net/tfstate]
module.data_ingester.azurerm_linux_function_app.SSPHP_rust: Refreshing state... [id=/subscriptions/32591f22-8209-4c82-a65c-618b967e7bff/resourceGroups/s194d00-SSPHP-Metrics/providers/Microsoft.Web/sites/SSPHP-Metrics-rust-p3sha]
module.data_ingester.azurerm_key_vault.SSPHP: Refreshing state... [id=/subscriptions/32591f22-8209-4c82-a65c-618b967e7bff/resourceGroups/s194d00-SSPHP-Metrics/providers/Microsoft.KeyVault/vaults/SSPHP-Metrics]
module.data_ingester.azurerm_key_vault_certificate.example: Refreshing state... [id=https://ssphp-metrics.vault.azure.net/certificates/ad-client-certificate/f824d238855648b581f1a3840c3e7286]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.data_ingester.azurerm_linux_function_app.SSPHP_rust has been deleted
  - resource "azurerm_linux_function_app" "SSPHP_rust" {
        id                                             = "/subscriptions/32591f22-8209-4c82-a65c-618b967e7bff/resourceGroups/s194d00-SSPHP-Metrics/providers/Microsoft.Web/sites/SSPHP-Metrics-rust-p3sha"
        name                                           = "SSPHP-Metrics-rust-p3sha"
        tags                                           = {
            "Environment"      = "Dev"
            "Product"          = "Protective Monitoring - Splunk SaaS"
            "Service Offering" = "Protective Monitoring - Splunk SaaS"
        }
        # (33 unchanged attributes hidden)

      - identity {
          - principal_id = "64301396-d6ff-4eda-8757-063fe3363efa" -> null
          - tenant_id    = "9c7d9dd3-840c-4b3f-818e-552865082e16" -> null
            # (2 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.data_ingester.azurerm_service_plan.SSPHP_rust has been deleted
  - resource "azurerm_service_plan" "SSPHP_rust" {
      - id                           = "/subscriptions/32591f22-8209-4c82-a65c-618b967e7bff/resourceGroups/s194d00-SSPHP-Metrics/providers/Microsoft.Web/serverFarms/SSPHP-Metrics_rust-p3sha" -> null
        name                         = "SSPHP-Metrics_rust-p3sha"
        tags                         = {
            "Environment"      = "Dev"
            "Product"          = "Protective Monitoring - Splunk SaaS"
            "Service Offering" = "Protective Monitoring - Splunk SaaS"
        }
        # (11 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.data_ingester.data.archive_file.data_ingester_rust will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "data_ingester_rust" {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = (known after apply)
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = "../data_ingester/../../data_ingester_workspace/data_ingester_axum_entrypoint/function_zip/"
      + type                = "zip"
    }

  # module.data_ingester.azurerm_key_vault.SSPHP will be updated in-place
  ~ resource "azurerm_key_vault" "SSPHP" {
      ~ access_policy                   = [
            # (4 unchanged elements hidden)
            {
                application_id          = null
                certificate_permissions = [
                    "Get",
                    "List",
                    "Create",
                    "Delete",
                ]
                key_permissions         = [
                    "Get",
                    "List",
                ]
                object_id               = "b7ecf1ae-c14f-4be8-a8d1-db7b5157d5d9"
                secret_permissions      = [
                    "Get",
                    "List",
                    "Set",
                ]
                storage_permissions     = [
                    "Get",
                    "List",
                    "Set",
                ]
                tenant_id               = "9c7d9dd3-840c-4b3f-818e-552865082e16"
            },
          ~ {
              ~ object_id               = "64301396-d6ff-4eda-8757-063fe3363efa" -> (known after apply)
              ~ tenant_id               = "9c7d9dd3-840c-4b3f-818e-552865082e16" -> (known after apply)
                # (5 unchanged attributes hidden)
            },
        ]
        id                              = "/subscriptions/32591f22-8209-4c82-a65c-618b967e7bff/resourceGroups/s194d00-SSPHP-Metrics/providers/Microsoft.KeyVault/vaults/SSPHP-Metrics"
        name                            = "SSPHP-Metrics"
        tags                            = {
            "Environment"      = "Dev"
            "Product"          = "Protective Monitoring - Splunk SaaS"
            "Service Offering" = "Protective Monitoring - Splunk SaaS"
        }
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.data_ingester.azurerm_linux_function_app.SSPHP_rust will be created
  + resource "azurerm_linux_function_app" "SSPHP_rust" {
      + app_settings                                   = {
          + "FUNCTIONS_EXTENSION_VERSION" = "~4"
          + "KEY_VAULT_NAME"              = "SSPHP-Metrics"
          + "RUST_BACKTRACE"              = "1"
          + "RUST_LOG"                    = "info"
          + "WEBSITE_RUN_FROM_PACKAGE"    = "1"
          + "alwaysOn"                    = "true"
          + "linuxFxVersion"              = null
        }
      + builtin_logging_enabled                        = true
      + client_certificate_enabled                     = false
      + client_certificate_mode                        = "Optional"
      + content_share_force_disabled                   = false
      + custom_domain_verification_id                  = (sensitive value)
      + daily_memory_time_quota                        = 0
      + default_hostname                               = (known after apply)
      + enabled                                        = true
      + ftp_publish_basic_authentication_enabled       = true
      + functions_extension_version                    = "~4"
      + hosting_environment_id                         = (known after apply)
      + https_only                                     = false
      + id                                             = (known after apply)
      + key_vault_reference_identity_id                = (known after apply)
      + kind                                           = (known after apply)
      + location                                       = "westeurope"
      + name                                           = "SSPHP-Metrics-rust-p3sha"
      + outbound_ip_address_list                       = (known after apply)
      + outbound_ip_addresses                          = (known after apply)
      + possible_outbound_ip_address_list              = (known after apply)
      + possible_outbound_ip_addresses                 = (known after apply)
      + public_network_access_enabled                  = true
      + resource_group_name                            = "s194d00-SSPHP-Metrics"
      + service_plan_id                                = (known after apply)
      + site_credential                                = (sensitive value)
      + storage_account_access_key                     = (sensitive value)
      + storage_account_name                           = "tfstatep3sha"
      + storage_uses_managed_identity                  = false
      + tags                                           = {
          + "Environment"      = "Dev"
          + "Product"          = "Protective Monitoring - Splunk SaaS"
          + "Service Offering" = "Protective Monitoring - Splunk SaaS"
        }
      + vnet_image_pull_enabled                        = false
      + webdeploy_publish_basic_authentication_enabled = true
      + zip_deploy_file                                = (known after apply)

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + site_config {
          + always_on                               = (known after apply)
          + app_scale_limit                         = (known after apply)
          + container_registry_use_managed_identity = false
          + default_documents                       = (known after apply)
          + detailed_error_logging_enabled          = (known after apply)
          + elastic_instance_minimum                = (known after apply)
          + ftps_state                              = "Disabled"
          + http2_enabled                           = false
          + ip_restriction_default_action           = "Allow"
          + linux_fx_version                        = (known after apply)
          + load_balancing_mode                     = "LeastRequests"
          + managed_pipeline_mode                   = "Integrated"
          + minimum_tls_version                     = "1.2"
          + pre_warmed_instance_count               = (known after apply)
          + remote_debugging_enabled                = false
          + remote_debugging_version                = (known after apply)
          + scm_ip_restriction_default_action       = "Allow"
          + scm_minimum_tls_version                 = "1.2"
          + scm_type                                = (known after apply)
          + scm_use_main_ip_restriction             = false
          + use_32_bit_worker                       = false
          + vnet_route_all_enabled                  = false
          + websockets_enabled                      = false
          + worker_count                            = (known after apply)

          + application_stack {
              + use_custom_runtime          = true
              + use_dotnet_isolated_runtime = false
            }

          + cors {
              + allowed_origins     = [
                  + "https://portal.azure.com",
                ]
              + support_credentials = true
            }
        }
    }

  # module.data_ingester.azurerm_service_plan.SSPHP_rust will be created
  + resource "azurerm_service_plan" "SSPHP_rust" {
      + id                           = (known after apply)
      + kind                         = (known after apply)
      + location                     = "westeurope"
      + maximum_elastic_worker_count = (known after apply)
      + name                         = "SSPHP-Metrics_rust-p3sha"
      + os_type                      = "Linux"
      + per_site_scaling_enabled     = false
      + reserved                     = (known after apply)
      + resource_group_name          = "s194d00-SSPHP-Metrics"
      + sku_name                     = "EP1"
      + tags                         = {
          + "Environment"      = "Dev"
          + "Product"          = "Protective Monitoring - Splunk SaaS"
          + "Service Offering" = "Protective Monitoring - Splunk SaaS"
        }
      + worker_count                 = (known after apply)
    }

Plan: 2 to add, 1 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.data_ingester.azurerm_storage_container.tfstate,
  on ../data_ingester/module.tf line 36, in resource "azurerm_storage_container" "tfstate":
  36:   storage_account_name  = azurerm_storage_account.tfstate.name

the `storage_account_name` property has been deprecated in favour of
`storage_account_id` and will be removed in version 5.0 of the Provider.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"
Releasing state lock. This may take a few moments...
stdout<<ghadelimiter_fec06fcc-fc7d-4338-8863-bda5a2592d2a
Acquiring state lock. This may take a few moments...
module.data_ingester.random_string.resource_code: Refreshing state... [id=p3sha]
module.data_ingester.data.azurerm_client_config.current: Reading...
module.data_ingester.azurerm_resource_group.tfstate: Refreshing state... [id=/subscriptions/32591f22-8209-4c82-a65c-618b967e7bff/resourceGroups/s194d00-SSPHP-Metrics]
module.data_ingester.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iN2VjMGExZC1hZjAyLTQ2YzUtOTdkMS05MDBkNGUzMmNmOTM7b2JqZWN0SWQ9YjdlY2YxYWUtYzE0Zi00YmU4LWE4ZDEtZGI3YjUxNTdkNWQ5O3N1YnNjcmlwdGlvbklkPTMyNTkxZjIyLTgyMDktNGM4Mi1hNjVjLTYxOGI5NjdlN2JmZjt0ZW5hbnRJZD05YzdkOWRkMy04NDBjLTRiM2YtODE4ZS01NTI4NjUwODJlMTY=]
module.data_ingester.azurerm_service_plan.SSPHP_rust: Refreshing state... [id=/subscriptions/32591f22-8209-4c82-a65c-618b967e7bff/resourceGroups/s194d00-SSPHP-Metrics/providers/Microsoft.Web/serverFarms/SSPHP-Metrics_rust-p3sha]
module.data_ingester.azurerm_storage_account.tfstate: Refreshing state... [id=/subscriptions/32591f22-8209-4c82-a65c-618b967e7bff/resourceGroups/s194d00-SSPHP-Metrics/providers/Microsoft.Storage/storageAccounts/tfstatep3sha]
module.data_ingester.azurerm_storage_container.tfstate: Refreshing state... [id=https://tfstatep3sha.blob.core.windows.net/tfstate]
module.data_ingester.azurerm_linux_function_app.SSPHP_rust: Refreshing state... [id=/subscriptions/32591f22-8209-4c82-a65c-618b967e7bff/resourceGroups/s194d00-SSPHP-Metrics/providers/Microsoft.Web/sites/SSPHP-Metrics-rust-p3sha]
module.data_ingester.azurerm_key_vault.SSPHP: Refreshing state... [id=/subscriptions/32591f22-8209-4c82-a65c-618b967e7bff/resourceGroups/s194d00-SSPHP-Metrics/providers/Microsoft.KeyVault/vaults/SSPHP-Metrics]
module.data_ingester.azurerm_key_vault_certificate.example: Refreshing state... [id=https://ssphp-metrics.vault.azure.net/certificates/ad-client-certificate/f824d238855648b581f1a3840c3e7286]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.data_ingester.azurerm_linux_function_app.SSPHP_rust has been deleted
  - resource "azurerm_linux_function_app" "SSPHP_rust" {
        id                                             = "/subscriptions/32591f22-8209-4c82-a65c-618b967e7bff/resourceGroups/s194d00-SSPHP-Metrics/providers/Microsoft.Web/sites/SSPHP-Metrics-rust-p3sha"
        name                                           = "SSPHP-Metrics-rust-p3sha"
        tags                                           = {
            "Environment"      = "Dev"
            "Product"          = "Protective Monitoring - Splunk SaaS"
            "Service Offering" = "Protective Monitoring - Splunk SaaS"
        }
        # (33 unchanged attributes hidden)

      - identity {
          - principal_id = "64301396-d6ff-4eda-8757-063fe3363efa" -> null
          - tenant_id    = "9c7d9dd3-840c-4b3f-818e-552865082e16" -> null
            # (2 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.data_ingester.azurerm_service_plan.SSPHP_rust has been deleted
  - resource "azurerm_service_plan" "SSPHP_rust" {
      - id                           = "/subscriptions/32591f22-8209-4c82-a65c-618b967e7bff/resourceGroups/s194d00-SSPHP-Metrics/providers/Microsoft.Web/serverFarms/SSPHP-Metrics_rust-p3sha" -> null
        name                         = "SSPHP-Metrics_rust-p3sha"
        tags                         = {
            "Environment"      = "Dev"
            "Product"          = "Protective Monitoring - Splunk SaaS"
            "Service Offering" = "Protective Monitoring - Splunk SaaS"
        }
        # (11 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.data_ingester.data.archive_file.data_ingester_rust will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "data_ingester_rust" {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = (known after apply)
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = "../data_ingester/../../data_ingester_workspace/data_ingester_axum_entrypoint/function_zip/"
      + type                = "zip"
    }

  # module.data_ingester.azurerm_key_vault.SSPHP will be updated in-place
  ~ resource "azurerm_key_vault" "SSPHP" {
      ~ access_policy                   = [
            # (4 unchanged elements hidden)
            {
                application_id          = null
                certificate_permissions = [
                    "Get",
                    "List",
                    "Create",
                    "Delete",
                ]
                key_permissions         = [
                    "Get",
                    "List",
                ]
                object_id               = "b7ecf1ae-c14f-4be8-a8d1-db7b5157d5d9"
                secret_permissions      = [
                    "Get",
                    "List",
                    "Set",
                ]
                storage_permissions     = [
                    "Get",
                    "List",
                    "Set",
                ]
                tenant_id               = "9c7d9dd3-840c-4b3f-818e-552865082e16"
            },
          ~ {
              ~ object_id               = "64301396-d6ff-4eda-8757-063fe3363efa" -> (known after apply)
              ~ tenant_id               = "9c7d9dd3-840c-4b3f-818e-552865082e16" -> (known after apply)
                # (5 unchanged attributes hidden)
            },
        ]
        id                              = "/subscriptions/32591f22-8209-4c82-a65c-618b967e7bff/resourceGroups/s194d00-SSPHP-Metrics/providers/Microsoft.KeyVault/vaults/SSPHP-Metrics"
        name                            = "SSPHP-Metrics"
        tags                            = {
            "Environment"      = "Dev"
            "Product"          = "Protective Monitoring - Splunk SaaS"
            "Service Offering" = "Protective Monitoring - Splunk SaaS"
        }
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.data_ingester.azurerm_linux_function_app.SSPHP_rust will be created
  + resource "azurerm_linux_function_app" "SSPHP_rust" {
      + app_settings                                   = {
          + "FUNCTIONS_EXTENSION_VERSION" = "~4"
          + "KEY_VAULT_NAME"              = "SSPHP-Metrics"
          + "RUST_BACKTRACE"              = "1"
          + "RUST_LOG"                    = "info"
          + "WEBSITE_RUN_FROM_PACKAGE"    = "1"
          + "alwaysOn"                    = "true"
          + "linuxFxVersion"              = null
        }
      + builtin_logging_enabled                        = true
      + client_certificate_enabled                     = false
      + client_certificate_mode                        = "Optional"
      + content_share_force_disabled                   = false
      + custom_domain_verification_id                  = (sensitive value)
      + daily_memory_time_quota                        = 0
      + default_hostname                               = (known after apply)
      + enabled                                        = true
      + ftp_publish_basic_authentication_enabled       = true
      + functions_extension_version                    = "~4"
      + hosting_environment_id                         = (known after apply)
      + https_only                                     = false
      + id                                             = (known after apply)
      + key_vault_reference_identity_id                = (known after apply)
      + kind                                           = (known after apply)
      + location                                       = "westeurope"
      + name                                           = "SSPHP-Metrics-rust-p3sha"
      + outbound_ip_address_list                       = (known after apply)
      + outbound_ip_addresses                          = (known after apply)
      + possible_outbound_ip_address_list              = (known after apply)
      + possible_outbound_ip_addresses                 = (known after apply)
      + public_network_access_enabled                  = true
      + resource_group_name                            = "s194d00-SSPHP-Metrics"
      + service_plan_id                                = (known after apply)
      + site_credential                                = (sensitive value)
      + storage_account_access_key                     = (sensitive value)
      + storage_account_name                           = "tfstatep3sha"
      + storage_uses_managed_identity                  = false
      + tags                                           = {
          + "Environment"      = "Dev"
          + "Product"          = "Protective Monitoring - Splunk SaaS"
          + "Service Offering" = "Protective Monitoring - Splunk SaaS"
        }
      + vnet_image_pull_enabled                        = false
      + webdeploy_publish_basic_authentication_enabled = true
      + zip_deploy_file                                = (known after apply)

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + site_config {
          + always_on                               = (known after apply)
          + app_scale_limit                         = (known after apply)
          + container_registry_use_managed_identity = false
          + default_documents                       = (known after apply)
          + detailed_error_logging_enabled          = (known after apply)
          + elastic_instance_minimum                = (known after apply)
          + ftps_state                              = "Disabled"
          + http2_enabled                           = false
          + ip_restriction_default_action           = "Allow"
          + linux_fx_version                        = (known after apply)
          + load_balancing_mode                     = "LeastRequests"
          + managed_pipeline_mode                   = "Integrated"
          + minimum_tls_version                     = "1.2"
          + pre_warmed_instance_count               = (known after apply)
          + remote_debugging_enabled                = false
          + remote_debugging_version                = (known after apply)
          + scm_ip_restriction_default_action       = "Allow"
          + scm_minimum_tls_version                 = "1.2"
          + scm_type                                = (known after apply)
          + scm_use_main_ip_restriction             = false
          + use_32_bit_worker                       = false
          + vnet_route_all_enabled                  = false
          + websockets_enabled                      = false
          + worker_count                            = (known after apply)

          + application_stack {
              + use_custom_runtime          = true
              + use_dotnet_isolated_runtime = false
            }

          + cors {
              + allowed_origins     = [
                  + "https://portal.azure.com",
                ]
              + support_credentials = true
            }
        }
    }

  # module.data_ingester.azurerm_service_plan.SSPHP_rust will be created
  + resource "azurerm_service_plan" "SSPHP_rust" {
      + id                           = (known after apply)
      + kind                         = (known after apply)
      + location                     = "westeurope"
      + maximum_elastic_worker_count = (known after apply)
      + name                         = "SSPHP-Metrics_rust-p3sha"
      + os_type                      = "Linux"
      + per_site_scaling_enabled     = false
      + reserved                     = (known after apply)
      + resource_group_name          = "s194d00-SSPHP-Metrics"
      + sku_name                     = "EP1"
      + tags                         = {
          + "Environment"      = "Dev"
          + "Product"          = "Protective Monitoring - Splunk SaaS"
          + "Service Offering" = "Protective Monitoring - Splunk SaaS"
        }
      + worker_count                 = (known after apply)
    }

Plan: 2 to add, 1 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.data_ingester.azurerm_storage_container.tfstate,
  on ../data_ingester/module.tf line 36, in resource "azurerm_storage_container" "tfstate":
  36:   storage_account_name  = azurerm_storage_account.tfstate.name

the `storage_account_name` property has been deprecated in favour of
`storage_account_id` and will be removed in version 5.0 of the Provider.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"
Releasing state lock. This may take a few moments...

ghadelimiter_fec06fcc-fc7d-4338-8863-bda5a2592d2a
stderr<<ghadelimiter_7405708d-96b4-48e9-b39c-13d1be74f8c3

ghadelimiter_7405708d-96b4-48e9-b39c-13d1be74f8c3
exitcode<<ghadelimiter_cd79ce75-0a75-4660-88eb-54650dc3a60c
0
ghadelimiter_cd79ce75-0a75-4660-88eb-54650dc3a60c
```